/*
	자기 소개 : 출신지역, 이름, 취미, 프로그래밍실습 교과목 학습에 대한
    자기 의지를 반드시 포함한 임의의 내용을 출력하는 프로그램.
    (반드시 줄바꿈 되어 출력되도록 해야함)
	
	학번 2018212236
	이름 김동주
	Ver 1.0 / 2018-03-19 / self-introduce.c
*/

#include <stdio.h>

int main(void)
{
    puts("출신지: 경기도 용인시");
    puts("이름:\t김동주");
    puts("취미:\t쪽잠자기, 노래부르기, 게임하기 등...\n");
    puts("각오:\t이미 C언어를 경험해 본 바가 있다하여 절대로 수업에 소홀히 하지 않겠습니다.");
    puts("\t독학으로 공부한 만큼 세밀하게 배우지 못한 부분, 놓치고 넘어간 부분이 분명 있을 것이라고 생각합니다.");
    puts("\t그렇기에 더더욱 교수님 말씀에 집중하고 적극적으로 참여하도록 하겠습니다.");
    puts("\t배워 갈 수 있는 것은 모두 배워갈 각오로 임하겠습니다.");
    puts("\t잘 부탁드립니다.");

    return 0;
}